blog/2021/wordpress-with-lamp.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 22:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Install WordPress With LAMP</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Install WordPress With LAMP</h1>
</header>
<div id="outline-container-lamp" class="outline-2">
<h2 id="lamp">LAMP</h2>
<div class="outline-text-2" id="text-lamp">
<p>
Linux, Apache, MySQL, PHP
</p>

<pre class="example" id="org9a31cd9">
sudo apt update
sudo apt-get install apache2 -y # apache2
sudo apt install php libapache2-mod-php # php, libapache2-mod-php
sudo systemctl restart apache2 # restart apache2
sudo apt-get install mariadb-server php-mysql -y # MariaDB Server and PHP-MySQL packages
sudo systemctl restart apache2 # restart apache2 again
cd /var/www/html/ # open web folder
sudo rm * # remove old files
sudo wget http://wordpress.org/latest.tar.gz # download WordPress
sudo tar xzf latest.tar.gz # extract WordPress tarball
sudo mv wordpress/* . # move WordPress files to /var/www/html/*
sudo rm -rf wordpress latest.tar.gz # remove wordpress folder and WordPress tarball
sudo apt install tree
tree -L 1
.
├── index.php
├── license.txt
├── readme.html
├── wp-activate.php
├── wp-admin
├── wp-blog-header.php
├── wp-comments-post.php
├── wp-config-sample.php
├── wp-content
├── wp-cron.php
├── wp-includes
├── wp-links-opml.php
├── wp-load.php
├── wp-login.php
├── wp-mail.php
├── wp-settings.php
├── wp-signup.php
├── wp-trackback.php
└── xmlrpc.php

3 directories, 16 files

sudo chown -R www-data: . # change ownership of all these files to Apache user
sudo mysql_secure_installation # MariaDB
sudo mysql -uroot -p # run MySQL
MariaDB [(none)]&gt; create database wordpress;
Query OK, 1 row affected (0.001 sec)
MariaDB [(none)]&gt; GRANT ALL PRIVILEGES ON wordpress.* TO 'root'@'hostname' IDENTIFIED BY '&lt;YOUR PASSWORD&gt;';
Query OK, 0 rows affected (0.012 sec)
MariaDB [(none)]&gt; FLUSH PRIVILEGES;
Query OK, 0 rows affected (0.001 sec)
# Exit the MariaDB prompt with Ctrl + D
sudo reboot # restart Raspberry Pi
</pre>

<p>
Write php file to test:
</p>

<pre class="example" id="orgf252585">
&lt;?php
phpinfo();
</pre>

<p>
Save to <code>test.php</code>, then access <code>http://ip/test.php</code>, will see the
phpinfo.
</p>

<p>
After execute <code>sudo mysql_secure_installation</code>:
</p>

<ul class="org-ul">
<li>You will be asked <code>Enter current password for root (enter for none):</code>
&#x2014; If you had set root password jusst input, or you can press <b>Enter</b>
to set it.</li>
<li>Type in <b>Y</b> and press <b>Enter</b> to <code>Set root password?</code>.</li>
<li>Type in a password at the <code>New password:</code> prompt, and press <b>Enter</b>.
<b>Important:</b> remember this root password, as you will need it later to
set up WordPress.</li>
<li>Type in <b>Y</b> to <code>Remove anonymous users</code>.</li>
<li>Type in <b>Y</b> to <code>Disallow root login remotely</code>.</li>
<li>Type in <b>Y</b> to <code>Remove test database and access to it</code>.</li>
<li>Type in <b>Y</b> to <code>Reload privilege tables now</code>.</li>
</ul>

<p>
When complete, you will see the message <code>All done!</code> and
<code>Thanks for using MariaDB!</code>.
</p>
</div>
</div>

<div id="outline-container-install-wordpress" class="outline-2">
<h2 id="install-wordpress">Install WordPress</h2>
<div class="outline-text-2" id="text-install-wordpress">
<p>
Then begin the WordPress installation.
</p>

<pre class="example" id="org70e001b">
Database Name:      wordpress
User Name:          root
Password:           &lt;YOUR PASSWORD&gt;
Database Host:      localhost
Table Prefix:       wp_
</pre>

<p>
After input these, if you get <code>Server Down</code> error, just run
<code>sudo systemctl restart apache2</code>.
</p>

<p>
Then:
</p>

<pre class="example" id="org60f47ec">
Site Title: tianheg
Username: root
Password: &lt;Set a password&gt;
Email: user@domain
</pre>

<p>
I like <a href="https://zenhabits.net/">https://zenhabits.net/</a>'s theme, I
<a href="https://zenhabits.net/theme/">download it</a>, install it.
</p>
</div>
</div>

<div id="outline-container-install-wordpress-theme" class="outline-2">
<h2 id="install-wordpress-theme">Install WordPress Theme</h2>
<div class="outline-text-2" id="text-install-wordpress-theme">
<ol class="org-ol">
<li>Access <code>http://address/wp-admin/</code></li>
<li>Click Appearance/Themes</li>
<li>Find Add New/Upload Theme, you can just upload the zh2 zip file.
That's it!</li>
<li>Custom it as you want.</li>
</ol>
</div>
</div>

<div id="outline-container-support-https" class="outline-2">
<h2 id="support-https">Support HTTPS</h2>
<div class="outline-text-2" id="text-support-https">
<p>
Before test these activity, must backup the site:
</p>

<p>
ref:
</p>

<ol class="org-ol">
<li><a href="https://projects.raspberrypi.org/en/projects/lamp-web-server-with-wordpress">https://projects.raspberrypi.org/en/projects/lamp-web-server-with-wordpress</a></li>
<li><a href="https://linuxize.com/post/how-to-install-php-on-ubuntu-20-04/">https://linuxize.com/post/how-to-install-php-on-ubuntu-20-04/</a></li>
<li><a href="https://www.wpbeginner.com/wp-tutorials/how-to-add-ssl-and-https-in-wordpress/">https://www.wpbeginner.com/wp-tutorials/how-to-add-ssl-and-https-in-wordpress/</a></li>
<li><a href="https://wordpress.org/plugins/really-simple-ssl/#installation">https://wordpress.org/plugins/really-simple-ssl/#installation</a></li>
</ol>
</div>
</div>
</div>
</body>
</html>